# LoadComponent Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LoadComponent Members
LoadComponent Class Constructors Methods Properties See Also
---
The LoadComponent type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| LoadComponent | Constructs a new instance of a LoadComponent. The load case or combination id. The load case or combination factor. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the LoadComponent |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Factor | Load component factor. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| LoadCaseOrCombinationId | Load case or combination id. |

# See Also
LoadComponent Class
Autodesk.Revit.DB.Structure Namespace